content/posts/20200528222132-org_capture.md
+++
title = "org-capture"
author = ["Daniel Biasiotto"]
draft = false
+++

-   source: <https://orgmode.org/manual/Capture.html#Capture>
-   tags: [Emacs]({{< relref "20200530210833-emacs.md" >}})


## Setting up {#setting-up}


### (setq org-default-notes-file (concat org-directory "/notes.org")) {#setq-org-default-notes-file-concat-org-directory-notes-dot-org}


#### directory di org-roam nel caso di {#directory-di-org-roam-nel-caso-di}

<!--list-separator-->

-  journal

    <!--list-separator-->

    -  usando `org-roam-today`

<!--list-separator-->

-  roam


#### directory di agenda o ledger nei casi {#directory-di-agenda-o-ledger-nei-casi}


## Activation {#activation}


### the three Org commands org-store-link, org-capture and org-agenda ought to be accessible anywhere in Emacs, not just in Org buffers. To that effect, you need to bind them to globally available keys, like the ones reserved for users (see [(elisp)Key Binding Conventions)](https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html). {#the-three-org-commands-org-store-link-org-capture-and-org-agenda-ought-to-be-accessible-anywhere-in-emacs-not-just-in-org-buffers-dot-to-that-effect-you-need-to-bind-them-to-globally-available-keys-like-the-ones-reserved-for-users--see-elisp--key-binding-conventions-dot}


#### (global-set-key (kbd "C-c l") 'org-store-link) {#global-set-key-kbd-c-c-l--org-store-link}


#### (global-set-key (kbd "C-c a") 'org-agenda) {#global-set-key-kbd-c-c-a--org-agenda}


#### (global-set-key (kbd "C-c c") 'org-capture) {#global-set-key-kbd-c-c-c--org-capture}


## Capture Templates {#capture-templates}


### org-mode-templates &lt;-- modifica questa variabile {#org-mode-templates-modifica-questa-variabile}

(setq org-capture-templates
  '(
    ("t" "Todo" entry (file+headline "~/org/gtd.org" "Tasks")
     "\* TODO %?\n  %i\n  %a")
    ("j" "Journal" entry (file+datetree "~/org/journal.org")
     "\* %?\nEntered on %U\n  %i\n  %a")
    ))


### per saltare il set-up {#per-saltare-il-set-up}

  (define-key global-map (kbd "C-c x")
(lambda () (interactive) (org-capture nil "x")))


### [Template Elements](https://orgmode.org/manual/Template-elements.html#Template-elements) {#template-elements}


#### keys {#keys}

<!--list-separator-->

-  "a" o "-tasto-"

<!--list-separator-->

-  "ab" per due tasti

    <!--list-separator-->

    -  in questo caso le combinazioni devono essere consequenziali e seguite da una descrizione


#### description {#description}

<!--list-separator-->

-  "blabla" - mostrata nella selezione


#### type {#type}

<!--list-separator-->

-  un simbolo

<!--list-separator-->

-  es

    <!--list-separator-->

    -  entry

        <!--list-separator-->

        -  org mode node

        <!--list-separator-->

        -  con headline

        <!--list-separator-->

        -  inserita come child della target entry

            <!--list-separator-->

            -  target deve essere .org

    <!--list-separator-->

    -  item

        <!--list-separator-->

        -  un oggetto lista

        <!--list-separator-->

        -  piazzata nella prima lista del target

            <!--list-separator-->

            -  target .org

    <!--list-separator-->

    -  checkitem

        <!--list-separator-->

        -  checkbox

        <!--list-separator-->

        -  nel resto uguale al item

    <!--list-separator-->

    -  table-line

        <!--list-separator-->

        -  nuova riga alla prima tabella del target

        <!--list-separator-->

        -  dove verra inserita dipende dalle proprieta'

            <!--list-separator-->

            -  :prepend

            <!--list-separator-->

            -  :tabel-line-pos

    <!--list-separator-->

    -  plain

        <!--list-separator-->

        -  testo che verra' incollato cosi' com'e'


#### target {#target}

<!--list-separator-->

-  dove verra' inserito l'elemento catturato

    <!--list-separator-->

    -  ‘(file "path/to/file")’

    <!--list-separator-->

    -  ‘(id "id of existing org entry")’

    <!--list-separator-->

    -  ‘(file+headline "filename" "node headline")’

    <!--list-separator-->

    -  ‘(file+olp "filename" "Level 1 heading" "Level 2" ...)’

    <!--list-separator-->

    -  ‘(file+regexp "filename" "regexp to find location")’

    <!--list-separator-->

    -  ‘(file+olp+datetree "filename" [ "Level 1 heading" ...])’

        <!--list-separator-->

        -  creates a heading in a date tree for today’s date. If the optional outline path is given, the tree will be built under the node it is pointing to, instead of at top level. Check out the :time-prompt and :tree-type properties

    <!--list-separator-->

    -  ‘(file+function "filename" function-finding-location)’

    <!--list-separator-->

    -  ‘(clock)’

    <!--list-separator-->

    -  ‘(function function-finding-location)’


#### template {#template}

<!--list-separator-->

-  The template for creating the capture item. If you leave this empty, an appropriate default template will be used. Otherwise this is a string with escape codes, which will be replaced depending on time and context of the capture call.

    (file "/path/to/template-file")
    (function FUNCTION-RETURNING-THE-TEMPLATE)


#### properties {#properties}

<!--list-separator-->

-  :prepend

<!--list-separator-->

-  :immediate-finish

<!--list-separator-->

-  :empty-lines

<!--list-separator-->

-  :clock-in

<!--list-separator-->

-  :clock-keep

<!--list-separator-->

-  :clock-resume

<!--list-separator-->

-  :time-prompt

<!--list-separator-->

-  :tree-type

<!--list-separator-->

-  :unnarrowed

<!--list-separator-->

-  :table-line-pos

<!--list-separator-->

-  :kill-buffer

<!--list-separator-->

-  :no-save


## Template expansion {#template-expansion}


### %-escapes {#escapes}


#### %[FILE] {#file}

inserisce contenuto da FILE


#### %(EXP) {#exp}

valuta un espressione Elist e rimpiazza con risultato, deve ritornare una stringa, puo' contenere solo %-escapes non interattivi


#### %&lt;FORMAT&gt; {#format}

risultato di format-time-string con FORMAT a parametro


#### %t/%T {#t-t}

timestamp solo data/data e ora


#### %u/%U {#u-u}

come sopra ma timestamp inattivi


#### %i {#i}

contenuto iniziale


#### %a/%A {#a-a}

annotazione/annotazione con prompt di descrizione


#### %l {#l}


#### %c {#c}


#### %x {#x}

x-clipboard


#### %k {#k}


#### %K {#k}


#### %n {#n}

nome


#### %f {#f}

file visitato quando viene chiamato org-capture


#### %F {#f}

path del file visitata dal buffer corrente


#### %:keyword {#keyword}

info per certi link


#### %^g {#g}

prompt per tag, autocompletati in target


#### %^G {#g}


#### %^t {#t}

t ma con propt


#### %<sup>PROMPT</sup> {#b189d2}

prompt per una stringa e rimpiazza la sequenza con quella inserita